// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

System.Console.WriteLine("Введите два числа ");
int min = Convert.ToInt32(System.Console.ReadLine());
int max = Convert.ToInt32(System.Console.ReadLine());

if (min > max )
    System.Console.WriteLine("Максимальное число " + min);

else  

    System.Console.WriteLine("Максимальное число " + max);
   
  





  

